Can't make the expected join because of editability and design option restrictions.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DesignOptionAndWorksetViolation { get; }
  Visual Basic
Public Shared ReadOnly Property DesignOptionAndWorksetViolation As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DesignOptionAndWorksetViolation {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AutoJoinFailures Class
  Autodesk.Revit.DB Namespace